Repository: kirrishima/FluentDownloader
Catalog: src/FluentDownloader/Strings/*/Resources.resw
Source language: en_us
Languages: ru_ru

# VideoUrlLabel.Text
source: Video URL:
ru_ru: Видео URL:

# UrlTextBox.PlaceholderText
source: Enter video or playlist URL
ru_ru: Введите ссылку на видео или плейлист

# OpenEditUrlButton.Content
source: Expand
ru_ru: Развернуть

# OpenEditUrlButton.ToolTipService.ToolTip
source: Open advanced URL settings
ru_ru: Открыть расширенные настройки URL

# SaveToLabel.Text
source: Save to:
ru_ru: Сохранить в:

# SavePathTextBox.PlaceholderText
source: Select destination folder
ru_ru: Выберите папку назначения

# SavePathTextBox.ToolTipService.ToolTip
source: Select folder video will be saved to.
ru_ru: Выберите папку, в которую будет сохранено видео.

# SavePathTeachingTip.Title
source: Select Destination Folder
ru_ru: Выбор папки назначения

# SavePathTeachingTip.Subtitle
source: Choose the folder where the video will be saved.
ru_ru: Выберите папку, в которую будет сохранено видео.

# SavePathButton.ToolTipService.ToolTip
source: Click to select folder with explorer.
ru_ru: Нажмите, чтобы выбрать папку через проводник.

# SavePathButtonTextBlock.Text
source: Browse
ru_ru: Обзор

# FormatTextBlock.Text
source: Format:
ru_ru: Формат:

# FormatComboBox.Header
source: Resolution
ru_ru: Разрешение

# FormatComboBox.PlaceholderText
source: Choose format
ru_ru: Выберите

# FormatComboBox.ToolTipService.ToolTip
source: --format: This option allows you to specify the format(s) of the video and/or audio to download.
ru_ru: --format: Эта опция позволяет указать формат(ы) видео и/или аудио для загрузки.

# FormatComboBoxItem1.Content
source: Bestvideo
ru_ru: Лучшее видео

# FormatComboBoxItem2.Content
source: Bestaudio
ru_ru: Лучшее аудио

# FormatComboBoxItem3.Content
source: Bestvideo+Bestaudio
ru_ru: Лучшее видео+Лучшее аудио

# VideoFormatComboBox.Header
source: Video format
ru_ru: Формат видео

# VideoFormatComboBox.PlaceholderText
source: Choose format
ru_ru: Выберите

# VideoFormatComboBox.ToolTipService.ToolTip
source: --merge-output-format: This option specifies the container format for the final output file when merging video and audio streams. If not merging, format can be distinct from chosen.
ru_ru: --merge-output-format: Эта опция определяет формат контейнера для итогового файла при объединении видео и аудио. Если объединение не требуется, формат может отличаться от выбранного.

# AudioFormatComboBox.Header
source: Audio format
ru_ru: Формат аудио

# AudioFormatComboBox.PlaceholderText
source: Choose format
ru_ru: Выберите

# AudioFormatComboBox.ToolTipService.ToolTip
source: --audio-format: This option specifies the format in which the audio should be downloaded or converted. If the specified format is not available, yt-dlp will attempt to convert the audio to the desired format.
ru_ru: --audio-format: Эта опция определяет формат, в котором аудио должно быть загружено или преобразовано. Если указанный формат недоступен, yt-dlp попытается преобразовать аудио в желаемый формат.

# RecodeVideFormatComboBox.Header
source: Recode video
ru_ru: Перекодировать

# RecodeVideFormatComboBox.PlaceholderText
source: Choose
ru_ru: Выберите

# RecodeVideFormatComboBox.ToolTipService.ToolTip
source: This option allows you to recode the video into a different format after downloading. Significantly uses CPU, can be *slow*.
ru_ru: Эта опция позволяет перекодировать видео в другой формат после загрузки. Значительно нагружает процессор, может быть *медленной*.

# FormatTeachingTip.Title
source: Select a format
ru_ru: Выберите формат

# FormatTeachingTip.Subtitle
source: You need to select a format for the download.
ru_ru: Необходимо выбрать формат для загрузки.

# EditTextDialog.Title
source: Edit URL
ru_ru: Редактировать URL

# EditTextDialog.CloseButtonText
source: Cancel
ru_ru: Отмена

# EditTextDialog.PrimaryButtonText
source: Save
ru_ru: Сохранить

# DownloadButton.ToolTipService.ToolTip
source: Use this button to download video formats and video in selected format
ru_ru: Используйте эту кнопку для загрузки видеоформатов и видео в выбранном формате

# DownloadButtonGetFormatsTextBlock.Text
source: Get Formats
ru_ru: Получить форматы

# DownloadButtonDownloadTextBlock.Text
source: Download
ru_ru: Загрузить

# DownloadButtonCancelPanelTextBlock.Text
source: Cancel
ru_ru: Отмена

# ResetDownloadFieldsButtonText.Text
source: Reset all
ru_ru: Сбросить всё

# ResetDownloadFieldsButton.ToolTipService.ToolTip
source: Resets the state of input fields, buttons and clears logs
ru_ru: Сбрасывает состояние полей ввода, кнопок и очищает логи

# LogsBlockHeader.Text
source: Download Logs:
ru_ru: Логи загрузки:

# SaveButtonTextContent.Content
source: Save
ru_ru: Сохранить

# ResetButtonTextContent.Content
source: Reset
ru_ru: Сбросить

# ResetToDefaultButtonTextContent.Content
source: Default
ru_ru: По умолчанию

# ConfirmButtonTextContent.Content
source: Confirm
ru_ru: Подтвердить

# NotImplementedYetInfoBar.Message
source: This feature has not been implemented in this version of the application yet. It may be added in one of the upcoming updates.
ru_ru: Данная функция ещё не реализована в этой версии приложения. Возможно, она будет добавлена в одном из следующих обновлений.

# AddToQueue.ToolTipService.ToolTip
source: Add to queue
ru_ru: Добавить в очередь
